code/app/Http/Controllers/Web/HomeController.php

    public function default_theme()
    {
        $brand_setting = BusinessSetting::where('type', 'product_brand')->first()->value;
        $home_categories = Category::where('home_status', true)->priority()->get();

        $return_orders_count = Order::where('order_status', 'Returned')
            ->where('customer_id', auth('customer')->id())
            ->count();
        session(['return_orders_count' => $return_orders_count]);

        $servicecategories = ServiceCategory::get();
        $home_categories->map(function ($data) {
            $id = '"' . $data['id'] . '"';
            $data['products'] = Product::active()
                ->where('category_ids', 'like', "%{$id}%")
                ->inRandomOrder()->take(12)->get();
        });
        //products based on top seller
        $top_sellers = Seller::approved()->with('shop')
            ->withCount(['orders'])->orderBy('orders_count', 'DESC')->take(12)->get();
---
select * from `business_settings` where `type` = 'product_brand' limit 1
select * from `categories` where `home_status` = 1 order by `priority` asc
select count(*) as aggregate from `orders` where `order_status` = 'Returned' and `customer_id` is null
select * from `service_categories`
select * from `shops` where `shops`.`seller_id` in (1, 2, 3, 4, 5, 6)

        //end

        $latest_products = Product::with(['reviews'])->active()->orderBy('id', 'desc')->take(8)->get();
        $categories = Category::with('childes.childes')->where(['position' => 0])->priority()->take(11)->get();
---
select * from `categories` where (`position` = 0) order by `priority` asc limit 11

            $topRated = $bestSellProduct;
        }

        $deal_of_the_day = DealOfTheDay::join('products', 'products.id', '=', 'deal_of_the_days.product_id')->select('deal_of_the_days.*', 'products.unit_price')->where('products.status', 1)->where('deal_of_the_days.status', 1)->first();
        $main_banner = Banner::where('banner_type', 'Main Banner')->where('published', 1)->latest()->get();
        $main_section_banner = \App\Model\Banner::where('banner_type', 'Main Section Banner')->where('published', 1)->orderBy('id', 'desc')->latest()->first();
---
select `deal_of_the_days`.*, `products`.`unit_price` from `deal_of_the_days` inner join `products` on `products`.`id` = `deal_of_the_days`.`product_id` where `products`.`status` = 1 and `deal_of_the_days`.`status` = 1 limit 1
select * from `banners` where `banner_type` = 'Main Banner' and `published` = 1 order by `created_at` desc
select * from `banners` where `banner_type` = 'Main Section Banner' and `published` = 1 order by `id` desc, `created_at` desc limit 1